Output from Terraform plan
```[command]/home/runner/work/_temp/888f51a0-0cbf-4fed-aca1-637b43c9fc31/terraform-bin plan -refresh=false -no-color -out=plan
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] must be replaced
-/+ resource "azurerm_automation_job_schedule" "job_schedules" {
      ~ id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/jobSchedules/5c131fd1-729a-42f6-9e6c-cfb7e7a9fbd6" -> (known after apply)
      ~ job_schedule_id         = "5c131fd1-729a-42f6-9e6c-cfb7e7a9fbd6" -> (known after apply)
      - parameters              = {} -> null
      ~ schedule_name           = "weekdays 7am" -> "weekdays 6am" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 6am"] will be created
  + resource "azurerm_automation_schedule" "schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "week"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "weekdays 6am"
      + resource_group_name     = "t2-oasys"
      + start_time              = (known after apply)
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7am"] will be destroyed
  - resource "azurerm_automation_schedule" "schedules" {
      - automation_account_name = "t2-oasys-automation-account" -> null
      - expiry_time             = "9999-12-31T23:59:00Z" -> null
      - frequency               = "Week" -> null
      - id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 7am" -> null
      - interval                = 1 -> null
      - month_days              = [] -> null
      - name                    = "weekdays 7am" -> null
      - resource_group_name     = "t2-oasys" -> null
      - start_time              = "2021-07-26T07:00:00+01:00" -> null
      - timezone                = "Europe/London" -> null
      - week_days               = [
          - "Friday",
          - "Monday",
          - "Thursday",
          - "Tuesday",
          - "Wednesday",
        ] -> null
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedules" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 7pm"
        name                    = "weekdays 7pm"
      ~ timezone                = "Europe/London" -> "UTC"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] must be replaced%0A-/+ resource "azurerm_automation_job_schedule" "job_schedules" {%0A      ~ id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/jobSchedules/5c131fd1-729a-42f6-9e6c-cfb7e7a9fbd6" -> (known after apply)%0A      ~ job_schedule_id         = "5c131fd1-729a-42f6-9e6c-cfb7e7a9fbd6" -> (known after apply)%0A      - parameters              = {} -> null%0A      ~ schedule_name           = "weekdays 7am" -> "weekdays 6am" # forces replacement%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 6am"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 6am"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7am"] will be destroyed%0A  - resource "azurerm_automation_schedule" "schedules" {%0A      - automation_account_name = "t2-oasys-automation-account" -> null%0A      - expiry_time             = "9999-12-31T23:59:00Z" -> null%0A      - frequency               = "Week" -> null%0A      - id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 7am" -> null%0A      - interval                = 1 -> null%0A      - month_days              = [] -> null%0A      - name                    = "weekdays 7am" -> null%0A      - resource_group_name     = "t2-oasys" -> null%0A      - start_time              = "2021-07-26T07:00:00+01:00" -> null%0A      - timezone                = "Europe/London" -> null%0A      - week_days               = [%0A          - "Friday",%0A          - "Monday",%0A          - "Thursday",%0A          - "Tuesday",%0A          - "Wednesday",%0A        ] -> null%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be updated in-place%0A  ~ resource "azurerm_automation_schedule" "schedules" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 7pm"%0A        name                    = "weekdays 7pm"%0A      ~ timezone                = "Europe/London" -> "UTC"%0A        # (8 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] must be replaced%0A-/+ resource "azurerm_automation_job_schedule" "job_schedules" {%0A      ~ id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/jobSchedules/5c131fd1-729a-42f6-9e6c-cfb7e7a9fbd6" -> (known after apply)%0A      ~ job_schedule_id         = "5c131fd1-729a-42f6-9e6c-cfb7e7a9fbd6" -> (known after apply)%0A      - parameters              = {} -> null%0A      ~ schedule_name           = "weekdays 7am" -> "weekdays 6am" # forces replacement%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 6am"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 6am"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7am"] will be destroyed%0A  - resource "azurerm_automation_schedule" "schedules" {%0A      - automation_account_name = "t2-oasys-automation-account" -> null%0A      - expiry_time             = "9999-12-31T23:59:00Z" -> null%0A      - frequency               = "Week" -> null%0A      - id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 7am" -> null%0A      - interval                = 1 -> null%0A      - month_days              = [] -> null%0A      - name                    = "weekdays 7am" -> null%0A      - resource_group_name     = "t2-oasys" -> null%0A      - start_time              = "2021-07-26T07:00:00+01:00" -> null%0A      - timezone                = "Europe/London" -> null%0A      - week_days               = [%0A          - "Friday",%0A          - "Monday",%0A          - "Thursday",%0A          - "Tuesday",%0A          - "Wednesday",%0A        ] -> null%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be updated in-place%0A  ~ resource "azurerm_automation_schedule" "schedules" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/schedules/weekdays 7pm"%0A        name                    = "weekdays 7pm"%0A      ~ timezone                = "Europe/London" -> "UTC"%0A        # (8 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::set-output name=stderr::
::set-output name=exitcode::0
```